cite:Gibbons2009

nix-shell -p "haskellPackages.ghcWithPackages (pkgs: [pkgs.trifecta])" --command ghci

* Testing Sqlite
:PROPERTIES:
:dir:      .
:db:       data.db
:END:

#+begin_src J :session jsesh :results silent
load'csv matchstats.ijs'
(ymatches 2009)writecsv'matches.csv'
#+end_src

#+begin_src sqlite :results silent
drop table match;
CREATE TABLE match(
  round TEXT,
  team TEXT,
  progression TEXT,
  score INTEGER,
  winner TEXT,
  opponent TEXT,
  venue TEXT,
  attendance INTEGER,
  season INTEGER,
  date TEXT
);
.mode csv
.import matches.csv match
#+end_src

#+begin_src sqlite 
select max(cnt) from 
   (select count(*) as cnt,date,venue from match group by venue,date) limit 5;
#+end_src

#+RESULTS:
: 2


